app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function admin_index()
    {
    $title = 'Daftar Artikel';
    $model = new ArtikelModel();
    $artikel = $model->findAll();